constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2100;
        startFace       971300;
    }
    outlet
    {
        type            patch;
        nFaces          2100;
        startFace       973400;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4710;
        startFace       975500;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4710;
        startFace       980210;
    }
    front
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          10990;
        startFace       984920;
        matchTolerance  0.0001;
        neighbourPatch  back;
        transformType   translational;
        separation      (0 0 0.2999999999999999);
    }
    back
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          10990;
        startFace       995910;
        matchTolerance  0.0001;
        neighbourPatch  front;
        transformType   translational;
        separation      (0 0 -0.2999999999999999);
    }
)

// ************************************************************************* //
