0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 7.5e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 7.5e-5;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 7.5e-5;
        value           uniform 7.5e-5;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 1e-12;
    }

    upperWall
    {
        type            slip;
    }

    "(front|back)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
