0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 8675; // 8675=125*69.4/1 ; // 0.011;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(outlet|upperWall)"
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            omegaWallFunction;
        blending        exponential;
        value           $internalField;
    }

    "(front|back)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
